DovPearX/vesc_express/sdkconfig.defaults.esp32c6_fh8
# default:
CONFIG_BOOTLOADER_OFFSET_IN_FLASH=0x0
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE is not set
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_DEBUG is not set
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y

#
# Log
#
# default:
CONFIG_BOOTLOADER_LOG_VERSION_1=y
# default:
CONFIG_BOOTLOADER_LOG_VERSION=1
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
# CONFIG_BOOTLOADER_LOG_LEVEL_ERROR is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_WARN is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_INFO is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_DEBUG is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_VERBOSE is not set
# default:
CONFIG_BOOTLOADER_LOG_LEVEL=0

#
# Format
#
# default:
# CONFIG_BOOTLOADER_LOG_COLORS is not set
# default:
CONFIG_BOOTLOADER_LOG_TIMESTAMP_SOURCE_CPU_TICKS=y
# end of Format

#
# Settings
#
# default:
CONFIG_BOOTLOADER_LOG_MODE_TEXT_EN=y
# default:
CONFIG_BOOTLOADER_LOG_MODE_TEXT=y
# end of Settings
# end of Log

# default:
CONFIG_BOOTLOADER_CPU_CLK_FREQ_MHZ=80

#
# Serial Flash Configurations
#
# default:
# CONFIG_BOOTLOADER_FLASH_DC_AWARE is not set
# default:
CONFIG_BOOTLOADER_FLASH_XMC_SUPPORT=y
# end of Serial Flash Configurations

# default:
# CONFIG_BOOTLOADER_FACTORY_RESET is not set
# default:
# CONFIG_BOOTLOADER_APP_TEST is not set
# default:
CONFIG_BOOTLOADER_REGION_PROTECTION_ENABLE=y
# default:
CONFIG_BOOTLOADER_WDT_ENABLE=y
# default:
# CONFIG_BOOTLOADER_WDT_DISABLE_IN_USER_CODE is not set
# default:
CONFIG_BOOTLOADER_WDT_TIME_MS=9000
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_ON_POWER_ON=y
# default:
# CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS is not set
# default:
CONFIG_BOOTLOADER_RESERVE_RTC_SIZE=0x10
# default:
# CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC is not set
# default:
CONFIG_BOOTLOADER_RESERVE_RTC_MEM=y
# end of Bootloader config

#
# Security features
#
# default:
CONFIG_SECURE_BOOT_V2_RSA_SUPPORTED=y
# default:
CONFIG_SECURE_BOOT_V2_ECC_SUPPORTED=y
# default:
CONFIG_SECURE_BOOT_V2_PREFERRED=y
# default:
# CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT is not set
# default:
# CONFIG_SECURE_BOOT is not set
# default:
# CONFIG_SECURE_FLASH_ENC_ENABLED is not set
# default:
CONFIG_SECURE_ROM_DL_MODE_ENABLED=y
# end of Security features

#
# Application manager
#
# default:
CONFIG_APP_COMPILE_TIME_DATE=y
# default:
# CONFIG_APP_EXCLUDE_PROJECT_VER_VAR is not set
# default:
# CONFIG_APP_EXCLUDE_PROJECT_NAME_VAR is not set
# default:
# CONFIG_APP_PROJECT_VER_FROM_CONFIG is not set
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16
# end of Application manager

# default:
CONFIG_ESP_ROM_HAS_CRC_LE=y
# default:
CONFIG_ESP_ROM_HAS_CRC_BE=y
# default:
CONFIG_ESP_ROM_HAS_JPEG_DECODE=y
# default:
CONFIG_ESP_ROM_UART_CLK_IS_XTAL=y
# default:
CONFIG_ESP_ROM_USB_SERIAL_DEVICE_NUM=3
# default:
CONFIG_ESP_ROM_HAS_RETARGETABLE_LOCKING=y
# default:
CONFIG_ESP_ROM_GET_CLK_FREQ=y
# default:
CONFIG_ESP_ROM_HAS_RVFPLIB=y
# default:
CONFIG_ESP_ROM_HAS_HAL_WDT=y
# default:
CONFIG_ESP_ROM_HAS_HAL_SYSTIMER=y
# default:
CONFIG_ESP_ROM_SYSTIMER_INIT_PATCH=y
# default:
CONFIG_ESP_ROM_HAS_HEAP_TLSF=y
# default:
CONFIG_ESP_ROM_TLSF_CHECK_PATCH=y
# default:
CONFIG_ESP_ROM_MULTI_HEAP_WALK_PATCH=y
# default:
CONFIG_ESP_ROM_HAS_LAYOUT_TABLE=y
# default:
CONFIG_ESP_ROM_HAS_SPI_FLASH=y
# default:
CONFIG_ESP_ROM_HAS_SPI_FLASH_MMAP=y
# default:
CONFIG_ESP_ROM_HAS_REGI2C_BUG=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB_NORMAL_FORMAT=y
# default:
CONFIG_ESP_ROM_REV0_HAS_NO_ECDSA_INTERFACE=y
# default:
CONFIG_ESP_ROM_WDT_INIT_PATCH=y
# default:
CONFIG_ESP_ROM_NEEDS_SET_CACHE_MMU_SIZE=y
# default:
CONFIG_ESP_ROM_RAM_APP_NEEDS_MMU_INIT=y
# default:
CONFIG_ESP_ROM_HAS_SW_FLOAT=y
# default:
CONFIG_ESP_ROM_USB_OTG_NUM=-1
# default:
CONFIG_ESP_ROM_HAS_VERSION=y
# default:
CONFIG_ESP_ROM_SUPPORT_DEEP_SLEEP_WAKEUP_STUB=y
# default:
CONFIG_ESP_ROM_HAS_OUTPUT_PUTC_FUNC=y
# default:
CONFIG_ESP_ROM_NO_USB_SERIAL_OUTPUT_API=y
# default:
CONFIG_ESP_ROM_HAS_SUBOPTIMAL_NEWLIB_ON_MISALIGNED_MEMORY=y
# default:
CONFIG_ESP_ROM_SUPPORT_SECURE_BOOT_FAST_WAKEUP=y

#
# Boot ROM Behavior
#
# CONFIG_BOOT_ROM_LOG_ALWAYS_ON is not set
CONFIG_BOOT_ROM_LOG_ALWAYS_OFF=y
# CONFIG_BOOT_ROM_LOG_ON_GPIO_HIGH is not set
# CONFIG_BOOT_ROM_LOG_ON_GPIO_LOW is not set
# end of Boot ROM Behavior

#
# ESP-TEE (Trusted Execution Environment)
#
# default:
# CONFIG_SECURE_ENABLE_TEE is not set
# default:
CONFIG_SECURE_TEE_LOG_LEVEL=0
# end of ESP-TEE (Trusted Execution Environment)

#
# Serial flasher config
#
# default:
# CONFIG_ESPTOOLPY_NO_STUB is not set
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# CONFIG_ESPTOOLPY_FLASHMODE_QOUT is not set
# CONFIG_ESPTOOLPY_FLASHMODE_DIO is not set
# CONFIG_ESPTOOLPY_FLASHMODE_DOUT is not set
# default:
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
# default:
CONFIG_ESPTOOLPY_FLASHMODE="dio"
# default:
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_40M is not set
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_20M is not set
# default:
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
# CONFIG_ESPTOOLPY_FLASHSIZE_1MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_4MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# CONFIG_ESPTOOLPY_FLASHSIZE_16MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_32MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_64MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_128MB is not set
# default:
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
# default:
# CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE is not set
# default:
CONFIG_ESPTOOLPY_BEFORE_RESET=y
# default:
# CONFIG_ESPTOOLPY_BEFORE_NORESET is not set
# default:
CONFIG_ESPTOOLPY_BEFORE="default-reset"
# default:
CONFIG_ESPTOOLPY_AFTER_RESET=y
# default:
# CONFIG_ESPTOOLPY_AFTER_NORESET is not set
# default:
CONFIG_ESPTOOLPY_AFTER="hard-reset"
# default:
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
# end of Serial flasher config

#
# Partition Table
#
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
# CONFIG_PARTITION_TABLE_TWO_OTA is not set
# CONFIG_PARTITION_TABLE_TWO_OTA_LARGE is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partition_ota_8mb.csv"
# default:
CONFIG_PARTITION_TABLE_FILENAME="partition_ota_8mb.csv"
# default:
CONFIG_PARTITION_TABLE_OFFSET=0x8000
# default:
CONFIG_PARTITION_TABLE_MD5=y
# end of Partition Table

#
# XPT2046
#
# default:
CONFIG_XPT2046_Z_THRESHOLD=400
# default:
# CONFIG_XPT2046_INTERRUPT_MODE is not set
# default:
# CONFIG_XPT2046_VREF_ON_MODE is not set
# default:
CONFIG_XPT2046_CONVERT_ADC_TO_COORDS=y
# default:
# CONFIG_XPT2046_ENABLE_LOCKING is not set
# end of XPT2046

#
# Compiler options
#
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
# CONFIG_COMPILER_OPTIMIZATION_SIZE is not set
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE is not set
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE is not set
CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE=y
# default:
# CONFIG_COMPILER_FLOAT_LIB_FROM_GCCLIB is not set
# default:
CONFIG_COMPILER_FLOAT_LIB_FROM_RVFPLIB=y
# default:
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=1
# default:
# CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT is not set
# CONFIG_COMPILER_HIDE_PATHS_MACROS is not set
# default:
# CONFIG_COMPILER_CXX_EXCEPTIONS is not set
# default:
# CONFIG_COMPILER_CXX_RTTI is not set
# default:
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_NORM is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_STRONG is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_ALL is not set
# default:
# CONFIG_COMPILER_NO_MERGE_CONSTANTS is not set
# default:
# CONFIG_COMPILER_WARN_WRITE_STRINGS is not set
# default:
# CONFIG_COMPILER_SAVE_RESTORE_LIBCALLS is not set
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
# default:
# CONFIG_COMPILER_DISABLE_GCC12_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC13_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC14_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC15_WARNINGS is not set
# default:
# CONFIG_COMPILER_DUMP_RTL_FILES is not set
# default:
CONFIG_COMPILER_RT_LIB_GCCLIB=y
# default:
CONFIG_COMPILER_RT_LIB_NAME="gcc"
# CONFIG_COMPILER_ORPHAN_SECTIONS_ERROR is not set
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
# CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE is not set
# default:
# CONFIG_COMPILER_STATIC_ANALYZER is not set
# default:
CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_NO_CHANGE=y
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD_CONSTEXPR is not set
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD is not set
# end of Compiler options

#
# Component config
#

#
# Bluetooth
#
CONFIG_BT_ENABLED=y
# default:
CONFIG_BT_BLUEDROID_ENABLED=y
# default:
# CONFIG_BT_NIMBLE_ENABLED is not set
# default:
# CONFIG_BT_CONTROLLER_ONLY is not set
# default:
CONFIG_BT_CONTROLLER_ENABLED=y
# default:
# CONFIG_BT_CONTROLLER_DISABLED is not set

#
# Common Options
#
# default:
CONFIG_BT_ALARM_MAX_NUM=50
# default:
CONFIG_BT_SMP_CRYPTO_STACK_TINYCRYPT=y
# default:
# CONFIG_BT_SMP_CRYPTO_STACK_MBEDTLS is not set

#
# BT Logs
#

#
# Log Sources
#
# default:
# CONFIG_BT_LE_CONTROLLER_LOG_ENABLED is not set
# end of Log Sources

# default:
# CONFIG_BLE_LOG_ENABLED is not set

#
# Legacy SPI Log Output (Deprecated - use BT Log Async Output instead)
#
# default:
# CONFIG_BT_BLE_LOG_SPI_OUT_ENABLED is not set
# end of Legacy SPI Log Output (Deprecated - use BT Log Async Output instead)
# end of BT Logs

# default:
# CONFIG_BT_LE_USED_MEM_STATISTICS_ENABLED is not set
# end of Common Options

#
# Bluedroid Options
#
# default:
CONFIG_BT_BTC_TASK_STACK_SIZE=3072
# default:
CONFIG_BT_BLUEDROID_PINNED_TO_CORE=0
CONFIG_BT_BTU_TASK_STACK_SIZE=2048
# default:
CONFIG_BT_BLUEDROID_ESP_COEX_VSC=y
# default:
CONFIG_BT_BLE_ENABLED=y
# default:
CONFIG_BT_GATTS_ENABLE=y
# default:
# CONFIG_BT_GATTS_PPCP_CHAR_GAP is not set
# default:
# CONFIG_BT_BLE_BLUFI_ENABLE is not set
CONFIG_BT_GATT_MAX_SR_PROFILES=4
CONFIG_BT_GATT_MAX_SR_ATTRIBUTES=20
# default:
# CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_MANUAL is not set
# default:
CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_AUTO=y
# default:
CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_MODE=0
# default:
# CONFIG_BT_GATTS_ROBUST_CACHING_ENABLED is not set
# default:
# CONFIG_BT_GATTS_DEVICE_NAME_WRITABLE is not set
# default:
# CONFIG_BT_GATTS_APPEARANCE_WRITABLE is not set
# default:
# CONFIG_BT_GATTS_SECURITY_LEVELS_CHAR is not set
# default:
# CONFIG_BT_GATTS_KEY_MATERIAL_CHAR is not set
# CONFIG_BT_GATTC_ENABLE is not set
# default:
CONFIG_BT_BLE_SMP_ENABLE=y
# default:
# CONFIG_BT_SMP_SLAVE_CON_PARAMS_UPD_ENABLE is not set
# default:
# CONFIG_BT_BLE_SMP_ID_RESET_ENABLE is not set
# default:
CONFIG_BT_BLE_SMP_BOND_NVS_FLASH=y

#
# Bluedroid debug option
#
# default:
# CONFIG_BT_BLUEDROID_MEM_DEBUG is not set
# default:
# CONFIG_BT_BLUEDROID_MEM_STATS is not set
# default:
# CONFIG_BT_BLUEDROID_THREAD_DEBUG is not set
# end of Bluedroid debug option

CONFIG_BT_STACK_NO_LOG=y
CONFIG_BT_ACL_CONNECTIONS=3
# CONFIG_BT_MULTI_CONNECTION_ENBALE is not set
# default:
# CONFIG_BT_ALLOCATION_FROM_SPIRAM_FIRST is not set
CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY=y
# default:
CONFIG_BT_SMP_ENABLE=y
# default:
CONFIG_BT_SMP_MAX_BONDS=15
# default:
# CONFIG_BT_BLE_ACT_SCAN_REP_ADV_SCAN is not set
# default:
CONFIG_BT_MAX_DEVICE_NAME_LEN=32
# default:
CONFIG_BT_BLE_RPA_TIMEOUT=900
# default:
# CONFIG_BT_BLE_HOST_ALLOW_SUB_SPEC_MIN_CONN_INT is not set
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# CONFIG_BT_BLE_42_DTM_TEST_EN is not set
# default:
CONFIG_BT_BLE_42_ADV_EN=y
# default:
CONFIG_BT_BLE_42_SCAN_EN=y
# default:
CONFIG_BT_BLE_VENDOR_HCI_EN=y
# default:
# CONFIG_BT_BLE_HIGH_DUTY_ADV_INTERVAL is not set
# default:
# CONFIG_BT_ABORT_WHEN_ALLOCATION_FAILS is not set
# end of Bluedroid Options

#
# Controller Options
#

#
# HCI Config
#
# default:
CONFIG_BT_LE_HCI_INTERFACE_USE_RAM=y
# default:
# CONFIG_BT_LE_HCI_INTERFACE_USE_UART is not set
# end of HCI Config

# default:
CONFIG_BT_LE_CONTROLLER_NPL_OS_PORTING_SUPPORT=y
# CONFIG_BT_LE_50_FEATURE_SUPPORT is not set

#
# Memory Settings
#
# default:
CONFIG_BT_LE_MSYS_1_BLOCK_COUNT=12
# default:
CONFIG_BT_LE_MSYS_1_BLOCK_SIZE=256
# default:
CONFIG_BT_LE_MSYS_2_BLOCK_COUNT=24
# default:
CONFIG_BT_LE_MSYS_2_BLOCK_SIZE=320
# default:
CONFIG_BT_LE_MSYS_BUF_FROM_HEAP=y
# default:
CONFIG_BT_LE_ACL_BUF_COUNT=10
# default:
CONFIG_BT_LE_ACL_BUF_SIZE=517
CONFIG_BT_LE_HCI_EVT_BUF_SIZE=257
# default:
CONFIG_BT_LE_HCI_EVT_HI_BUF_COUNT=30
# default:
CONFIG_BT_LE_HCI_EVT_LO_BUF_COUNT=8
# end of Memory Settings

# default:
CONFIG_BT_LE_CONTROLLER_TASK_STACK_SIZE=4096

#
# Controller debug features
#
# default:
# CONFIG_BT_LE_ERROR_SIM_ENABLED is not set
# default:
# CONFIG_BT_LE_ASSERT_WHEN_ABNORMAL_DISCONN_ENABLED is not set
# default:
# CONFIG_BT_LE_DEBUG_REMAIN_SCENE_ENABLED is not set
# default:
# CONFIG_BT_LE_PTR_CHECK_ENABLED is not set
# default:
# CONFIG_BT_LE_MEM_CHECK_ENABLED is not set
# end of Controller debug features

# default:
CONFIG_BT_LE_LL_RESOLV_LIST_SIZE=4
# default:
CONFIG_BT_LE_SECURITY_ENABLE=y
# default:
CONFIG_BT_LE_SM_LEGACY=y
# default:
CONFIG_BT_LE_SM_SC=y
# default:
# CONFIG_BT_LE_SM_SC_DEBUG_KEYS is not set
# default:
CONFIG_BT_LE_LL_CFG_FEAT_LE_ENCRYPTION=y
# default:
CONFIG_BT_LE_WHITELIST_SIZE=12
# default:
CONFIG_BT_LE_LL_DUP_SCAN_LIST_COUNT=20
# default:
CONFIG_BT_LE_LL_SCA=60
# default:
# CONFIG_BT_LE_LL_PEER_SCA_SET_ENABLE is not set
# default:
CONFIG_BT_LE_MAX_CONNECTIONS=3
# default:
# CONFIG_BT_LE_COEX_PHY_CODED_TX_RX_TLIM_EN is not set
# default:
CONFIG_BT_LE_COEX_PHY_CODED_TX_RX_TLIM_DIS=y
# default:
CONFIG_BT_LE_COEX_PHY_CODED_TX_RX_TLIM_EFF=0
# default:
# CONFIG_BT_LE_SLEEP_ENABLE is not set
# default:
CONFIG_BT_LE_LP_CLK_SRC_MAIN_XTAL=y
# default:
# CONFIG_BT_LE_LP_CLK_SRC_DEFAULT is not set
# default:
CONFIG_BT_LE_USE_ESP_TIMER=y
# default:
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_SUPP=y
# default:
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_NUM=100
# default:
CONFIG_BT_CTRL_BLE_ADV_REPORT_DISCARD_THRSHOLD=20
# default:
CONFIG_BT_LE_SCAN_DUPL=y
# default:
CONFIG_BT_LE_SCAN_DUPL_TYPE_DEVICE=y
# default:
# CONFIG_BT_LE_SCAN_DUPL_TYPE_DATA is not set
# default:
# CONFIG_BT_LE_SCAN_DUPL_TYPE_DATA_DEVICE is not set
# default:
CONFIG_BT_LE_SCAN_DUPL_TYPE=0
# default:
CONFIG_BT_LE_SCAN_DUPL_CACHE_REFRESH_PERIOD=0
# default:
CONFIG_BT_LE_MSYS_INIT_IN_CONTROLLER=y
# default:
# CONFIG_BT_LE_TX_CCA_ENABLED is not set
# default:
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_N15 is not set
# default:
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_N12 is not set
# default:
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_N9 is not set
# default:
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_N6 is not set
# default:
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_N3 is not set
# default:
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_N0 is not set
# default:
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P3 is not set
# default:
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P6 is not set
# default:
CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P9=y
# default:
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P12 is not set
# default:
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P15 is not set
# default:
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P18 is not set
# default:
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P20 is not set
# default:
CONFIG_BT_LE_DFT_TX_POWER_LEVEL_DBM_EFF=9
# default:
# CONFIG_BT_LE_CTRL_CHECK_CONNECT_IND_ACCESS_ADDRESS is not set
# default:
# CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY is not set

#
# BLE disconnects when Instant Passed (0x28) occurs
#
# default:
# CONFIG_BT_LE_CTRL_LLCP_CONN_UPDATE is not set
# default:
# CONFIG_BT_LE_CTRL_LLCP_CHAN_MAP_UPDATE is not set
# default:
# CONFIG_BT_LE_CTRL_LLCP_PHY_UPDATE is not set
# end of BLE disconnects when Instant Passed (0x28) occurs

# default:
CONFIG_BT_CTRL_SCAN_BACKOFF_UPPERLIMITMAX=32
# default:
# CONFIG_BT_LE_CTRL_CHAN_ASS_EN is not set
# default:
CONFIG_BT_LE_CTRL_ADV_DATA_LENGTH_ZERO_AUX=y
# default:
CONFIG_BT_LE_RXBUF_OPT_ENABLED=y
# default:
CONFIG_BT_LE_CTRL_FAST_CONN_DATA_TX_EN=y

#
# Reserved Memory Config
#
# default:
CONFIG_BT_LE_EXT_ADV_RESERVED_MEMORY_COUNT=2
# default:
CONFIG_BT_LE_CONN_RESERVED_MEMORY_COUNT=2
# end of Reserved Memory Config

# default:
# CONFIG_BT_LE_DTM_ENABLED is not set

#
# Scheduling Priority Level Config
#
# default:
CONFIG_BT_LE_ADV_SCHED_PRIO_LOW_LEVEL=y
# default:
# CONFIG_BT_LE_ADV_SCHED_PRIO_MID_LEVEL is not set
# default:
# CONFIG_BT_LE_ADV_SCHED_PRIO_HIGH_LEVEL is not set
# default:
CONFIG_BT_LE_DFT_ADV_SCHED_PRIO_LEVEL=0
# default:
# CONFIG_BT_LE_PERIODIC_ADV_SCHED_PRIO_LOW_LEVEL is not set
# default:
CONFIG_BT_LE_PERIODIC_ADV_SCHED_PRIO_MID_LEVEL=y
# default:
# CONFIG_BT_LE_PERIODIC_ADV_SCHED_PRIO_HIGH_LEVEL is not set
# default:
CONFIG_BT_LE_DFT_PERIODIC_ADV_SCHED_PRIO_LEVEL=1
# default:
# CONFIG_BT_LE_SYNC_SCHED_PRIO_LOW_LEVEL is not set
# default:
CONFIG_BT_LE_SYNC_SCHED_PRIO_MID_LEVEL=y
# default:
# CONFIG_BT_LE_SYNC_SCHED_PRIO_HIGH_LEVEL is not set
# default:
CONFIG_BT_LE_DFT_SYNC_SCHED_PRIO_LEVEL=1
# end of Scheduling Priority Level Config

# default:
# CONFIG_BT_LE_CTRL_SLV_FAST_RX_CONN_DATA_EN is not set
# default:
# CONFIG_BT_LE_CTRL_DL_ITVL_PHY_SYNC_EN is not set
# default:
# CONFIG_BT_LE_CTRL_ADV_FAST_TX_EN is not set

#
# Adv Tx Options
#
# default:
# CONFIG_BT_LE_CTRL_ADV_EVENT_INC_ON_FULL_TX_EN is not set
# default:
# CONFIG_BT_LE_CTRL_ADV_CH38_39_TX_AVOID_CONFLICT_EN is not set
# default:
# CONFIG_BT_LE_ADV_CH39_TXPWR_CONFIG_SEPARATELY_EN is not set
# default:
# CONFIG_BT_LE_CTRL_ADV_TX_CONTINUE_WHEN_EXCEED_ITVL_EN is not set
# default:
# CONFIG_BT_LE_CTRL_ADV_RAND_CH_IDX_EN is not set
# end of Adv Tx Options
# end of Controller Options

# default:
# CONFIG_BT_HCI_LOG_DEBUG_EN is not set
# end of Bluetooth

# default:
# CONFIG_BLE_MESH is not set

#
# Console Library
#
# default:
# CONFIG_CONSOLE_SORTED_HELP is not set
# end of Console Library

#
# Legacy Driver Configurations
#

