DovPearX/vesc_express/sdkconfig.defaults.esp32c6_fh8
#
# Core Configuration
#
# default:
CONFIG_MBEDTLS_VER_4_X_SUPPORT=y
# default:
# CONFIG_MBEDTLS_COMPILER_OPTIMIZATION_NONE is not set
# default:
CONFIG_MBEDTLS_COMPILER_OPTIMIZATION_SIZE=y
# default:
# CONFIG_MBEDTLS_COMPILER_OPTIMIZATION_PERF is not set
# default:
CONFIG_MBEDTLS_FS_IO=y
# CONFIG_MBEDTLS_THREADING_C is not set
# CONFIG_MBEDTLS_ERROR_STRINGS is not set
# default:
# CONFIG_MBEDTLS_ERROR_STRERROR_DUMMY is not set
# default:
CONFIG_MBEDTLS_VERSION_C=y
# default:
CONFIG_MBEDTLS_HAVE_TIME=y
# default:
# CONFIG_MBEDTLS_PLATFORM_TIME_ALT is not set
# default:
# CONFIG_MBEDTLS_HAVE_TIME_DATE is not set
# default:
CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC=y
# default:
# CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC is not set
# default:
# CONFIG_MBEDTLS_CUSTOM_MEM_ALLOC is not set
# default:
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=1024
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=1024
# default:
# CONFIG_MBEDTLS_DYNAMIC_BUFFER is not set
# default:
# CONFIG_MBEDTLS_VERSION_FEATURES is not set
# default:
# CONFIG_MBEDTLS_DEBUG is not set
# default:
CONFIG_MBEDTLS_SELF_TEST=y
# end of Core Configuration

#
# Certificates
#
# default:
CONFIG_MBEDTLS_X509_USE_C=y
# default:
CONFIG_MBEDTLS_PEM_PARSE_C=y
# default:
CONFIG_MBEDTLS_PEM_WRITE_C=y
# default:
CONFIG_MBEDTLS_PK_C=y
# default:
CONFIG_MBEDTLS_PK_PARSE_C=y
# default:
CONFIG_MBEDTLS_PK_WRITE_C=y
# default:
# CONFIG_MBEDTLS_X509_REMOVE_INFO is not set
# default:
CONFIG_MBEDTLS_X509_CRL_PARSE_C=y
# default:
CONFIG_MBEDTLS_X509_CRT_PARSE_C=y
# default:
CONFIG_MBEDTLS_X509_CSR_PARSE_C=y
# default:
# CONFIG_MBEDTLS_X509_CREATE_C is not set
# default:
CONFIG_MBEDTLS_X509_RSASSA_PSS_SUPPORT=y
# default:
# CONFIG_MBEDTLS_X509_TRUSTED_CERT_CALLBACK is not set
# default:
CONFIG_MBEDTLS_ASN1_PARSE_C=y
# default:
CONFIG_MBEDTLS_ASN1_WRITE_C=y
# default:
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

#
# Certificate Bundle Configuration
#
# default:
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# default:
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN is not set
# default:
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_NONE is not set
# default:
# CONFIG_MBEDTLS_CUSTOM_CERTIFICATE_BUNDLE is not set
# default:
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEPRECATED_LIST is not set
# default:
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_MAX_CERTS=200
# end of Certificate Bundle Configuration

# default:
# CONFIG_MBEDTLS_ALLOW_WEAK_CERTIFICATE_VERIFICATION is not set
# default:
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY is not set
# end of Certificates

# default:
CONFIG_MBEDTLS_TLS_ENABLED=y

#
# TLS Protocol Configuration
#
# default:
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
# default:
# CONFIG_MBEDTLS_SSL_PROTO_TLS1_3 is not set
# default:
# CONFIG_MBEDTLS_SSL_PROTO_GMTSSL1_1 is not set
# default:
CONFIG_MBEDTLS_TLS_SERVER=y
# default:
CONFIG_MBEDTLS_TLS_CLIENT=y
# default:
CONFIG_MBEDTLS_TLS_SERVER_AND_CLIENT=y
# default:
# CONFIG_MBEDTLS_TLS_SERVER_ONLY is not set
# default:
# CONFIG_MBEDTLS_TLS_CLIENT_ONLY is not set
# default:
# CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE is not set
# default:
# CONFIG_MBEDTLS_SSL_CONTEXT_SERIALIZATION is not set
# default:
CONFIG_MBEDTLS_SSL_CACHE_C=y
# default:
CONFIG_MBEDTLS_SSL_ALL_ALERT_MESSAGES=y

#
# TLS Key Exchange Configuration
#
# default:
# CONFIG_MBEDTLS_PSK_MODES is not set
# default:
CONFIG_MBEDTLS_KEY_EXCHANGE_RSA=y
# default:
CONFIG_MBEDTLS_KEY_EXCHANGE_ELLIPTIC_CURVE=y
# default:
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_RSA=y
# default:
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_ECDSA=y
# end of TLS Key Exchange Configuration

# default:
CONFIG_MBEDTLS_SSL_SERVER_NAME_INDICATION=y
# default:
CONFIG_MBEDTLS_SSL_ALPN=y
# default:
CONFIG_MBEDTLS_SSL_MAX_FRAGMENT_LENGTH=y
# default:
# CONFIG_MBEDTLS_SSL_VARIABLE_BUFFER_LENGTH is not set
# default:
CONFIG_MBEDTLS_SSL_RENEGOTIATION=y
# default:
CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=y
# default:
CONFIG_MBEDTLS_SERVER_SSL_SESSION_TICKETS=y
# default:
# CONFIG_MBEDTLS_SSL_KEYING_MATERIAL_EXPORT is not set
# end of TLS Protocol Configuration

# default:
# CONFIG_MBEDTLS_SSL_PROTO_DTLS is not set

#
# Symmetric Ciphers
#
# default:
CONFIG_MBEDTLS_AES_C=y
# default:
# CONFIG_MBEDTLS_CAMELLIA_C is not set
# default:
# CONFIG_MBEDTLS_ARIA_C is not set
# default:
# CONFIG_MBEDTLS_DES_C is not set
# default:
CONFIG_MBEDTLS_CCM_C=y
# default:
CONFIG_MBEDTLS_CIPHER_MODE_CBC=y
# default:
CONFIG_MBEDTLS_CIPHER_MODE_CFB=y
# default:
CONFIG_MBEDTLS_CIPHER_MODE_CTR=y
# default:
CONFIG_MBEDTLS_CIPHER_MODE_OFB=y
# default:
CONFIG_MBEDTLS_CIPHER_MODE_XTS=y
# default:
CONFIG_MBEDTLS_GCM_C=y
# default:
# CONFIG_MBEDTLS_NIST_KW_C is not set
# default:
CONFIG_MBEDTLS_AES_ROM_TABLES=y
# default:
# CONFIG_MBEDTLS_AES_FEWER_TABLES is not set
# default:
# CONFIG_MBEDTLS_AES_ONLY_128_BIT_KEY_LENGTH is not set
# default:
CONFIG_MBEDTLS_CMAC_C=y
# end of Symmetric Ciphers

#
# Asymmetric Ciphers
#
# default:
CONFIG_MBEDTLS_RSA_C=y
# default:
CONFIG_MBEDTLS_ECP_C=y

#
# Supported Curves
#
# default:
CONFIG_MBEDTLS_ECP_DP_SECP256R1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_SECP384R1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_SECP521R1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_SECP256K1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_BP256R1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_BP384R1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_BP512R1_ENABLED=y
# default:
CONFIG_MBEDTLS_ECP_DP_CURVE25519_ENABLED=y
# end of Supported Curves

#
# Elliptic Curve Ciphers Configuration
#
# default:
CONFIG_MBEDTLS_ECP_NIST_OPTIM=y
# default:
# CONFIG_MBEDTLS_ECP_FIXED_POINT_OPTIM is not set
# default:
# CONFIG_MBEDTLS_DHM_C is not set
# default:
CONFIG_MBEDTLS_ECDH_C=y
# default:
# CONFIG_MBEDTLS_ECJPAKE_C is not set
# default:
CONFIG_MBEDTLS_ECDSA_C=y
# default:
CONFIG_MBEDTLS_PK_PARSE_EC_EXTENDED=y
# default:
CONFIG_MBEDTLS_PK_PARSE_EC_COMPRESSED=y
# default:
CONFIG_MBEDTLS_ECDSA_DETERMINISTIC=y
# default:
# CONFIG_MBEDTLS_ECP_RESTARTABLE is not set
# end of Elliptic Curve Ciphers Configuration
# end of Asymmetric Ciphers

#
# Hash functions
#
# default:
# CONFIG_MBEDTLS_RIPEMD160_C is not set
# default:
CONFIG_MBEDTLS_MD_C=y
# default:
CONFIG_MBEDTLS_MD5_C=y
# default:
CONFIG_MBEDTLS_SHA1_C=y
# default:
# CONFIG_MBEDTLS_SHA224_C is not set
# default:
CONFIG_MBEDTLS_SHA256_C=y
# default:
CONFIG_MBEDTLS_SHA384_C=y
# default:
CONFIG_MBEDTLS_SHA512_C=y
# default:
# CONFIG_MBEDTLS_SHA3_C is not set
# default:
CONFIG_MBEDTLS_ROM_MD5=y
# end of Hash functions

#
# Hardware Acceleration
#
# default:
CONFIG_MBEDTLS_HARDWARE_ECC=y
# default:
CONFIG_MBEDTLS_ECC_OTHER_CURVES_SOFT_FALLBACK=y
# default:
CONFIG_MBEDTLS_HARDWARE_SHA=y
# CONFIG_MBEDTLS_HARDWARE_MPI is not set
# default:
CONFIG_MBEDTLS_HARDWARE_AES=y
# default:
# CONFIG_MBEDTLS_AES_SOFT_FALLBACK is not set
# default:
CONFIG_MBEDTLS_GCM_SUPPORT_NON_AES_CIPHER=y
# default:
CONFIG_MBEDTLS_AES_USE_INTERRUPT=y
# default:
CONFIG_MBEDTLS_AES_INTERRUPT_LEVEL=0
# default:
CONFIG_MBEDTLS_AES_HW_SMALL_DATA_LEN_OPTIM=y
# default:
# CONFIG_MBEDTLS_ATCA_HW_ECDSA_SIGN is not set
# default:
# CONFIG_MBEDTLS_ATCA_HW_ECDSA_VERIFY is not set
# default:
CONFIG_MBEDTLS_HARDWARE_RSA_DS_PERIPHERAL=y
# end of Hardware Acceleration

#
# Entropy and Random Number Generation
#
# default:
# CONFIG_MBEDTLS_ENTROPY_FORCE_SHA256 is not set
# default:
CONFIG_MBEDTLS_CTR_DRBG_C=y
# default:
CONFIG_MBEDTLS_HMAC_DRBG_C=y
# end of Entropy and Random Number Generation

#
# Encoding/Decoding
#
# default:
CONFIG_MBEDTLS_BASE64_C=y
# default:
CONFIG_MBEDTLS_PKCS5_C=y
# default:
CONFIG_MBEDTLS_PKCS7_C=y
# default:
CONFIG_MBEDTLS_PKCS1_V15=y
# default:
CONFIG_MBEDTLS_PKCS1_V21=y
# end of Encoding/Decoding

#
# Stream Cipher
#
# default:
# CONFIG_MBEDTLS_CHACHA20_C is not set
# end of Stream Cipher
# end of mbedTLS

#
# NVS
#
# default:
# CONFIG_NVS_ENCRYPTION is not set
# default:
# CONFIG_NVS_ASSERT_ERROR_CHECK is not set
# default:
# CONFIG_NVS_LEGACY_DUP_KEYS_COMPATIBILITY is not set
# default:
# CONFIG_NVS_BDL_STACK is not set
# default:
# CONFIG_NVS_FLASH_VERIFY_ERASE is not set
# end of NVS

#
# OpenThread
#
# default:
# CONFIG_OPENTHREAD_ENABLED is not set

#
# OpenThread Spinel
#
# default:
# CONFIG_OPENTHREAD_SPINEL_ONLY is not set
# end of OpenThread Spinel

# default:
# CONFIG_OPENTHREAD_DEBUG is not set
# end of OpenThread

#
# Protocomm
#
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_0=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
# default:
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_2=y
# default:
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_PATCH_VERSION=y
# end of Protocomm

#
# PThreads
#
# default:
CONFIG_PTHREAD_TASK_PRIO_DEFAULT=5
# default:
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=3072
# default:
CONFIG_PTHREAD_STACK_MIN=768
# default:
CONFIG_PTHREAD_TASK_CORE_DEFAULT=-1
# default:
CONFIG_PTHREAD_TASK_NAME_DEFAULT="pthread"
# end of PThreads

#
# SD Protocol Layer Configuration
#
# default:
CONFIG_SD_ENABLE_SDIO_SUPPORT=y
# end of SD Protocol Layer Configuration

#
# MMU Config
#
# default:
CONFIG_MMU_PAGE_SIZE_64KB=y
# default:
CONFIG_MMU_PAGE_MODE="64KB"
# default:
CONFIG_MMU_PAGE_SIZE=0x10000
# end of MMU Config

#
# Main Flash configuration
#

#
# SPI Flash behavior when brownout
#
# default:
CONFIG_SPI_FLASH_BROWNOUT_RESET_XMC=y
# default:
CONFIG_SPI_FLASH_BROWNOUT_RESET=y
# end of SPI Flash behavior when brownout

#
# Optional and Experimental Features (READ DOCS FIRST)
#

#
# Features here require specific hardware (READ DOCS FIRST!)
#
# default:
CONFIG_SPI_FLASH_SUSPEND_TSUS_VAL_US=50
# default:
# CONFIG_SPI_FLASH_FORCE_ENABLE_XMC_C_SUSPEND is not set
# default:
# CONFIG_SPI_FLASH_FORCE_ENABLE_C6_H2_SUSPEND is not set
# default:
CONFIG_SPI_FLASH_PLACE_FUNCTIONS_IN_IRAM=y
# end of Optional and Experimental Features (READ DOCS FIRST)
# end of Main Flash configuration

#
# SPI Flash driver
#
# default:
# CONFIG_SPI_FLASH_ENABLE_COUNTERS is not set
CONFIG_SPI_FLASH_ROM_IMPL=y
# default:
CONFIG_SPI_FLASH_DANGEROUS_WRITE_ABORTS=y
# default:
# CONFIG_SPI_FLASH_DANGEROUS_WRITE_FAILS is not set
# default:
# CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED is not set
# default:
# CONFIG_SPI_FLASH_BYPASS_BLOCK_ERASE is not set
# default:
CONFIG_SPI_FLASH_YIELD_DURING_ERASE=y
# default:
CONFIG_SPI_FLASH_ERASE_YIELD_DURATION_MS=20
# default:
CONFIG_SPI_FLASH_ERASE_YIELD_TICKS=1
# default:
CONFIG_SPI_FLASH_WRITE_CHUNK_SIZE=8192
# default:
# CONFIG_SPI_FLASH_SIZE_OVERRIDE is not set
# default:
# CONFIG_SPI_FLASH_CHECK_ERASE_TIMEOUT_DISABLED is not set
# default:
# CONFIG_SPI_FLASH_OVERRIDE_CHIP_DRIVER_LIST is not set

#
# Auto-detect flash chips
#
# default:
CONFIG_SPI_FLASH_VENDOR_XMC_SUPPORT_ENABLED=y
# default:
CONFIG_SPI_FLASH_VENDOR_GD_SUPPORT_ENABLED=y
# default:
# CONFIG_SPI_FLASH_SUPPORT_ISSI_CHIP is not set
# default:
# CONFIG_SPI_FLASH_SUPPORT_MXIC_CHIP is not set
# default:
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y
# default:
# CONFIG_SPI_FLASH_SUPPORT_WINBOND_CHIP is not set
# default:
# CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP is not set
# default:
# CONFIG_SPI_FLASH_SUPPORT_TH_CHIP is not set
# end of Auto-detect flash chips

# CONFIG_SPI_FLASH_ENABLE_ENCRYPTED_READ_WRITE is not set
# end of SPI Flash driver

#
# SPIFFS Configuration
#
# default:
CONFIG_SPIFFS_MAX_PARTITIONS=3

#
# SPIFFS Cache Configuration
#
# default:
CONFIG_SPIFFS_CACHE=y
# default:
CONFIG_SPIFFS_CACHE_WR=y
# default:
# CONFIG_SPIFFS_CACHE_STATS is not set
# end of SPIFFS Cache Configuration

# default:
CONFIG_SPIFFS_PAGE_CHECK=y
# default:
CONFIG_SPIFFS_GC_MAX_RUNS=10
# default:
# CONFIG_SPIFFS_GC_STATS is not set
# default:
CONFIG_SPIFFS_PAGE_SIZE=256
# default:
CONFIG_SPIFFS_OBJ_NAME_LEN=32
# default:
# CONFIG_SPIFFS_FOLLOW_SYMLINKS is not set
# default:
CONFIG_SPIFFS_USE_MAGIC=y
# default:
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y
# default:
CONFIG_SPIFFS_META_LENGTH=4
# default:
CONFIG_SPIFFS_USE_MTIME=y

#
# Debug Configuration
#
# default:
# CONFIG_SPIFFS_DBG is not set
# default:
# CONFIG_SPIFFS_API_DBG is not set
# default:
# CONFIG_SPIFFS_GC_DBG is not set
# default:
# CONFIG_SPIFFS_CACHE_DBG is not set
# default:
# CONFIG_SPIFFS_CHECK_DBG is not set
# default:
# CONFIG_SPIFFS_TEST_VISUALISATION is not set
# end of Debug Configuration
# end of SPIFFS Configuration

#
# TCP Transport
#

#
# Websocket
#
# CONFIG_WS_TRANSPORT is not set
# end of Websocket
# end of TCP Transport

#
# Ultra Low Power (ULP) Co-processor
#
# default:
# CONFIG_ULP_COPROC_ENABLED is not set

#
# ULP Debugging Options
#
# end of ULP Debugging Options
# end of Ultra Low Power (ULP) Co-processor

#
# Unity unit testing library
#
# default:
CONFIG_UNITY_ENABLE_FLOAT=y
# default:
CONFIG_UNITY_ENABLE_DOUBLE=y
# default:
# CONFIG_UNITY_ENABLE_64BIT is not set
# default:
# CONFIG_UNITY_ENABLE_COLOR is not set
# default:
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y
# default:
# CONFIG_UNITY_ENABLE_FIXTURE is not set
# default:
# CONFIG_UNITY_ENABLE_BACKTRACE_ON_FAIL is not set
# end of Unity unit testing library

#
# Virtual file system
#
# default:
CONFIG_VFS_SUPPORT_IO=y
# default:
CONFIG_VFS_SUPPORT_DIR=y
# default:
CONFIG_VFS_SUPPORT_SELECT=y
# default:
CONFIG_VFS_SUPPRESS_SELECT_DEBUG_OUTPUT=y
# default:
# CONFIG_VFS_SELECT_IN_RAM is not set
CONFIG_VFS_SUPPORT_TERMIOS=y
# default:
CONFIG_VFS_MAX_COUNT=8
# default:
# CONFIG_VFS_SUPPRESS_CTX_DEPRECATION is not set

#
# Host File System I/O (Semihosting)
#
# default:
CONFIG_VFS_SEMIHOSTFS_MAX_MOUNT_POINTS=1
# end of Host File System I/O (Semihosting)

# default:
CONFIG_VFS_INITIALIZE_DEV_NULL=y
# end of Virtual file system

#
# Wear Levelling
#
CONFIG_WL_SECTOR_SIZE_512=y
# CONFIG_WL_SECTOR_SIZE_4096 is not set
# default:
CONFIG_WL_SECTOR_SIZE=512
# default:
# CONFIG_WL_SECTOR_MODE_PERF is not set
# default:
CONFIG_WL_SECTOR_MODE_SAFE=y
# default:
CONFIG_WL_SECTOR_MODE=1
# end of Wear Levelling

#
# CMake Utilities
#
# default:
# CONFIG_CU_RELINKER_ENABLE is not set
# default:
# CONFIG_CU_DIAGNOSTICS_COLOR_NEVER is not set
# default:
CONFIG_CU_DIAGNOSTICS_COLOR_ALWAYS=y
# default:
# CONFIG_CU_DIAGNOSTICS_COLOR_AUTO is not set
# default:
# CONFIG_CU_GCC_LTO_ENABLE is not set
# default:
# CONFIG_CU_GCC_STRING_1BYTE_ALIGN is not set
# end of CMake Utilities

#
# ESP LCD TOUCH
#
# default:
CONFIG_ESP_LCD_TOUCH_MAX_POINTS=5
# default:
CONFIG_ESP_LCD_TOUCH_MAX_BUTTONS=1
# end of ESP LCD TOUCH

#
# ESP LCD TOUCH - CST816S
#
# default:
# CONFIG_ESP_LCD_TOUCH_CST816S_DISABLE_READ_ID is not set
# end of ESP LCD TOUCH - CST816S

#
# SPI NAND Flash configuration
#
# default:
# CONFIG_NAND_FLASH_VERIFY_WRITE is not set
# default:
# CONFIG_NAND_FLASH_ENABLE_BDL is not set
# end of SPI NAND Flash configuration
# end of Component config

# default:
# CONFIG_IDF_EXPERIMENTAL_FEATURES is not set

